app/controllers/application_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2021-11-15 10:11:28.152688"], ["updated_at", "2021-11-15 10:11:28.152688"]]
---
      def current_cart
        if session[:cart_id]

          cart = Cart.find_by(:id => session[:cart_id])

          if cart.present?
            @current_cart = cart
          else
            session[:cart_id] = nil
          end
        end

        if session[:cart_id] == nil

          @current_cart = Cart.create