app/controllers/orders_controller.rb

  def create
    @order = Order.new(order_params)
    @current_cart.line_items.each do |item|
      @order.line_items << item
      item.cart_id = nil
    end
    @order.save
    Cart.destroy(session[:cart_id])
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 5]]
INSERT INTO "orders" ("name", "email", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "abc"], ["email", "abc@abc"], ["address", "abc"], ["created_at", "2021-11-11 09:43:35.456007"], ["updated_at", "2021-11-11 09:43:35.456007"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 5]]